org/todo/todo.org
#+setupfile: ../setup.org

#+hugo_bundle: todo
#+export_file_name: index

#+title: blog's todo
#+date: <2021-02-23 二 17:10>
#+hugo_categories: test
#+hugo_tags: test
#+hugo_draft: true
#+hugo_custom_front_matter: :comment false :featured_image images/featured.jpg  :series '(test)

* 博客
** 如何同步到公众号/其它专栏
*** 格式化工具
*** 直接导出 html 的方式
*** 富文本 copy vs html copy
*** inspect clip board
** 算法
*** 枚举 排列
**** 递归
**** next
**** 可重集
**** 和回溯，解答树的关系
*** 枚举 子集
**** cpp multiset
** 配色理论

https://zhuanlan.zhihu.com/p/52120537

https://www.sohu.com/a/352611094_286880

https://www.sohu.com/a/397541366_100031423

https://zhuanlan.zhihu.com/p/49575075

** 摄影理论
*** 参数
*** 纽约
** 音乐与乐器
*** 弦乐器的音高安排
**** 品丝
**** 距离
** 记忆音名，唱名
*** 草稿
** 和弦的命名方式
*** m7 9
*** nicechord
*** 配合 吉他 尤克里里 理解
*** guitar pro
** 单音与和弦的搭配原理
*** nicechord
** 文本编辑
*** 正则表达式工具
**** sed
**** grep
**** awk
** cf 851b 分析
  - https://blog.csdn.net/zsnowwolfy/article/details/82793414
** 3 点共线 计算
  - 涉及三角形面积为 0 的各种计算
  - 关注 行列式的方式，行列式与面积 体积的关系 线性代数
** git submodule 中项目指定 hash
** 图的最短路径理论
  - 算法导论
  - 最优性条件
  - dijkstra算法 的正确性
	- 为什么不能是负边
  - dag 中的拓扑加速
  - bellman ford
** 反证法的正确性 （充分性  必要性）
** emacs key bindings 研究与配置
** how RE == NFA == DFA
** how scanner generator works (table driven / if else driven)
** manjaro config best practise
  - 各种迁移，熟悉工具的配置
  - fzf
  - autojump
** krusader 预览功能的使用

* 自我
** 一个人的每日积累
*** 视频
*** 文章
*** 编程
**** 在程序的世界里 你就是神
**** cli
**** 项目分析与源码
**** 算法研究与实现，论文
**** 数学
***** 线性代数
***** 微积分
**** 代码方面的成长
*** PS/AI
** 为何要保持写代码
*** 一线程序员，写代码为何不应停止
** 职业生涯
*** system design?
**** 面向对象设计
**** python 实现
*** 从大学研究项目方向来选择？
**** 计算摄影
** 问题集合与解决方案
*** 短期的
**** 职业
**** 孩子
*** 长期的
**** 教育
**** 住房
** 自我论
*** 自我的剖析
*** 剖析的方法
*** 对事物的有限接触，不足以证明你没有其它的可能性
*** 接触新事物
** 为何要成为企业家
*** 人生如此多方向，为什么是它
*** 阶级，财富，地位
*** 什么是商业思维
*** 改变社会的力量
*** 不是体制内，就是体制外
*** 成为生产者
*** 做同一件事，总在不断精进
*** 事情都是有限的
*** hello world 是什么
** 成为企业家需要什么
*** 道，术，需求有一个重合点，才能 3 者都不违背，不违初心
*** 研究其它公司
**** 战略
**** 产品
**** 历史
*** 商业是需求/业务为导向的
*** 法务
*** 财务
*** 业务
*** 采购
*** 销售
*** 管理
** 人与道的关系
*** 人性
*** 道的规律
*** 宏观与微观？
*** 道中无人，完全受自然规律支配？
*** 宿命论，人的性格，决定了自己的道
** 小大之辨
*** 一将功成万骨枯
*** 受资本压制的个人
*** 是否是资本的问题，还是个人的问题
*** 个人是否绝对没有自由
*** 不同阶级有不同的优势和劣势
*** 资本有问题，个人也有问题
*** 资本是一种规则，别人可以在其位，自己也可以，竞争是公平的
*** 人天生有惰性
*** 自由是惰性的无所作为吗
*** 别人的成功，没有损害你的利益，为何眼红不放
*** 工人
**** 陷入 996，无时间改变自己，被压榨
**** 有转职的自由，但是还是相同的结局
**** 内部竞争，无工会联合
**** 拼命肯干，造就的经济成果
**** 国人性格的特性，低头，卑微
*** 上层者
**** 只关注利润和增长
**** 自动化效率
**** 下放中产的美称
*** 如何跨越
*** 需求来自用户，产品卖给用户，由用户来开发
*** 谁来控制这个环的运作
*** 个人财富，只能来自于一个群体的付出
* 理论
** 如何写作
*** 讲理，说服摇摆的心
*** 做决定，以及做决定的理由
*** 辩证论
**** 挑战的热情 vs 面对困境无路的挫折
** 如何购买基金
** 创业理论
*** 技术创业，如 PingCAP？
*** 技术选型，所有技术的深入了解，对业务需求的评测
** 健身动作新探索
*** 哑铃的刺激
*** 罗马椅
** 联接理论
*** 以人为核心
*** 六度空间
**** 一度联系人
*** 社会组织者
**** 开源会议
**** 校友？
**** 篮球活动
  
